In [15]:
import pandas as pd
df = pd.read_csv('data/censo_sp.csv', encoding = "ISO-8859-1")
df.head()

,COD_SETOR,COD_GRANDE,NOME_GRAND,COD_UF,NOME_DA_UF,COD_MESO,NOME_DA_ME,COD_MICRO,NOME_DA_MI,COD_RM,...,COD_DISTRI,NOME_DO_DI,COD_SUBDIS,NOME_DO_SU,COD_BAIRRO,NOME_DO_BA,SITUACAO_S,V001,V002,V003
0,355030801000001,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,355030801,ÁGUA RASA,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,266.0,800.0,301.0
1,355030801000002,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,355030801,ÁGUA RASA,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,306.0,913.0,298.0
2,355030801000003,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,355030801,ÁGUA RASA,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,189.0,625.0,331.0
3,355030801000004,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,355030801,ÁGUA RASA,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,181.0,572.0,316.0
4,355030801000005,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,355030801,ÁGUA RASA,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,240.0,754.0,314.0

In [16]:
def splitname(row):
    row['first'] = row['NOME_DA_ME'].split(" ")[0]
    row['last'] = row['NOME_DA_ME'].split(" ")[-1]
    return row

In [17]:
df=df.apply(splitname,axis='columns')
df.head()

,COD_SETOR,COD_GRANDE,NOME_GRAND,COD_UF,NOME_DA_UF,COD_MESO,NOME_DA_ME,COD_MICRO,NOME_DA_MI,COD_RM,...,COD_SUBDIS,NOME_DO_SU,COD_BAIRRO,NOME_DO_BA,SITUACAO_S,V001,V002,V003,first,last
0,355030801000001,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,266.0,800.0,301.0,Metropolitana,Paulo
1,355030801000002,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,306.0,913.0,298.0,Metropolitana,Paulo
2,355030801000003,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,189.0,625.0,331.0,Metropolitana,Paulo
3,355030801000004,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,181.0,572.0,316.0,Metropolitana,Paulo
4,355030801000005,3,Região Sudeste,35,São Paulo,3515,Metropolitana de São Paulo,35061,São Paulo,20,...,35503080100,ÁGUA RASA,3550308000,SÃO PAULO (todos os setores),1,240.0,754.0,314.0,Metropolitana,Paulo

In [18]:
del(df['first'])
del(df['last'])

In [20]:
# pergar só a primeira e a última palavra de NOME_DA_ME
pattern="(?P<First>^[\w]*)(?:.* )(?P<Last>[\w]*$)"

df['NOME_DA_ME'].str.extract(pattern).head()

           First   Last
0  Metropolitana  Paulo
1  Metropolitana  Paulo
2  Metropolitana  Paulo
3  Metropolitana  Paulo
4  Metropolitana  Paulo

In [52]:
df = pd.read_csv('data/censo_sp.csv', encoding = "ISO-8859-1")

df.rename(mapper = lambda x: x.lower(), axis='columns').columns

Index(['cod_setor', 'cod_grande', 'nome_grand', 'cod_uf', 'nome_da_uf',
       'cod_meso', 'nome_da_me', 'cod_micro', 'nome_da_mi', 'cod_rm',
       'nome_da_rm', 'cod_munici', 'nome_do_mu', 'cod_distri', 'nome_do_di',
       'cod_subdis', 'nome_do_su', 'cod_bairro', 'nome_do_ba', 'situacao_s',
       'v001', 'v002', 'v003'],
      dtype='object')

In [75]:
df = pd.read_csv('data/grades.csv', index_col='id')
df

    gre score  toelf score
id
1         337          118
2         324          107
3         316          104
4         322          110
5         314          103

In [77]:
df.where(df['toelf score']>105).dropna()

    gre score  toelf score
id
1       337.0        118.0
2       324.0        107.0
4       322.0        110.0

In [78]:
df[df['toelf score']>105]

    gre score  toelf score
id
1         337          118
2         324          107
4         322          110

In [85]:
df.drop('gre score',axis=1)

    toelf score
id
1           118
2           107
3           104
4           110
5           103

In [86]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [88]:
s1

1    Alice
2     Jack
3    Molly
dtype: object

In [89]:
s2

Alice    1
Jack     2
Molly    3
dtype: int64

In [90]:
s2[1]

2

In [91]:
s2.iloc[1]

2

In [97]:
for a in s1.iteritems():
    print (a)

(1, 'Alice')
(2, 'Jack')
(3, 'Molly')

In [99]:
s1.append(s2)

1        Alice
2         Jack
3        Molly
Alice        1
Jack         2
Molly        3
dtype: object

In [101]:
df = pd.read_csv('data/grades.csv', index_col='id')
df

    gre score  toelf score
id
1         337          118
2         324          107
3         316          104
4         322          110
5         314          103

In [104]:
df[(df['toelf score']>105) & (df['toelf score']<115)]

    gre score  toelf score
id
2         324          107
4         322          110

In [110]:
df['toelf score'].isin(range(106, 115))

id
1    False
2     True
3    False
4     True
5    False
Name: toelf score, dtype: bool

In [111]:
df

    gre score  toelf score
id
1         337          118
2         324          107
3         316          104
4         322          110
5         314          103

In [117]:
df.T[1]

gre score      337
toelf score    118
Name: 1, dtype: int64